[
    "Pour cornmeal on fabric or upholstery to absorb grease stains. Apply enough to cover the soiled area and let it sit for a half hour, and then vacuum to remove the cornmeal mess.",
    "You know that sticky residue that collects on irons? Run the iron (don’t use the steam setting) over white paper sprinkled with salt.",
    "Add 1/2 cup of lemon juice to a load of laundry to brighten whites.",
    "Got some lipstick on your favorite shirt? Saturate the spot with hair spray (be sure the fabric is machine washable) and let it sit for at least 10 minutes. Dab with a damp cloth to remove and launder as usual.",
    "That stubborn coffee stain that rims your mugs? Remove them with a lightly salted citrus peel.",
    "Clean your microwave by placing a glass bowl filled with 1/4 cup vinegar and 1 cup water inside and heating it for five minutes on the highest setting. After the mixture cools, use a cloth dipped in it to wipe off splattered food stains.",
    "Toss thin lemon rinds and ice cubes into your garbage disposal. You’ll freshen the drain and sharpen the disposal blades at the same time.",
    "When you boil eggs, add some salt to keep the shells from doing that annoying cracking thing.",
    "Put a slice of bread in a bag of hard brown sugar and check it a few days later. The brown sugar will soften and become usable (and edible) again.",
    "Put an apple in your potato bag to keep the potatoes from budding.",
    "This was my mom’s favorite: keep lettuce fresh by wrapping it in a clean, dry paper towel and storing it all in a sealed plastic baggie in the fridge.",
    "Keep the refrigerator vegetable drawer fresh-smelling and dry by lining the bottom with newspaper.",
    "Rub onions over silverware to remove rust stains.",
    "Soak blackened pots in water with two denture (or antacid) tablets overnight. Rinse off, and the pots are clean! Denture tablets in water will also clean the residue that clings to the inside of vases.",
    "Decrease the tarnishing process on your good silver by putting chalk pieces in cheesecloth and storing the whole thing with your cutlery.",
    "Apply a bit of baby oil to a cotton cloth and use it to shine your bathroom chrome.",
    "Make a paste out of lemon juice and salt and use it to scour and disinfect your bathroom surfaces (but don’t use on marble!).",
    "Keep your drains clear by adding 1 cup of baking soda and 1 cup of white vinegar to them (in that order) and allow to fizz. Twenty minutes later, rinse with hot water. The same mixture applied to shower heads will unclog the nozzle.",
    "Fill a spray bottle with half vinegar, half water and spray the shower walls with it after every rinse to dispel mold and mildew.",
    "One crushed aspirin added to a gallon of water and poured in the soil helps plants stay alive during transplanting, cutting, etc. This aspirin solution will also keep your cut flowers fresher longer.",
    "If you want to make a flower bed in a place where grass is growing, wait for fall and then mow a patch of lawn to accommodate the space and cover it with four to five layers of newspaper. Then add a four-inch later of bark mulch. Water it all down with a hose and in the spring, the grass will be gone and the bed will be ready for planting.",
    "Add 1 tablespoon of Dr. Bonner’s peppermint-scented liquid soap to 1/2 gallon of water. Use the mixture to spray on plants to kill aphids and other garden pests.",
    "Use alcohol in a spray bottle to kill bugs in your home.",
    "Fix little holes in your window screens by painting some clear nail polish over the holes.",
    "Clean your windows with vinegar water and newspaper.",
    "Remove permanent marker from counters and walls by dabbing a rubbing-alcohol-containing cotton ball over the stain (test for color-fastness first).",
    "Get paint off your skin with vegetable oil. Vegetable oil on a soft cloth can also help remove scuff marks.",
    "A slice of cucumber over each eye will reduce the tired, swollen look (fine, it’s not really a household tip, but I couldn’t resist this oldie and goodie).",
    "Wrap a paper towel around your oil containers to keep them free from grease and drips.",
    "Easily clean your coffee grinder with uncooked, white rice.",
    "Spray your freezer with cooking spray.",
    "Use plain white toothpaste to clean your wedding rings.",
    "Get rid of fruit flies with apple cider vinegar and sugar or you can stick cloves in an orange or apple to repel them forever.",
    "Use olive oil to condition leather furniture or you can use shoe polish to hide small scratches.",
    "Use Lemon Pledge on your shower doors.",
    "Use cut grapefruit sprinkled with salt to remove bathtub rings.",
    "Use melted crayon to hide deep scratches in wood floors.",
    "Run your hot clothing iron over aluminum foil sprinkled with salt to clean it.",
    "Use a few drops of essential oil on a cotton ball and place inside the filter compartment of your vacuum.",
    "Use newspaper in the refrigerator to absorb smells or you can use a small bowl of activated charcoal.",
    "Use Alka-Seltzer tablets to unclog your sink and shower drains.",
    "Clean smelly jars and containers with mustard.",
    "Get rid of odors in your closet with a onion or use bundled chalk to get rid of musty odors.",
    "Rub your lightbulbs with vanilla extract or your favorite perfume.",
    "Use white flour to clean up spills in the kitchen.",
    "Use mouthwash to clean your toilet.",
    "Repurpose used coffee grounds or leftover eggshells to scrub pots and pans.",
    "Clean copper with ketchup, fresh lemon or pickle juice.",
    "Soak your sponges or mops in salty water overnight.",
    "Soak oven racks in the bathtub with dryer sheets overnight.",
    "Polish wood furniture with beer.",
    "Clean windows and mirrors with black tea.",
    "Add a lemon peel to your dishwasher.",
    "Clean your faucets with wax paper."
]